#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# (if/elif/else)

# Заданы размеры envelop_x, envelop_y - размеры конверта и paper_x, paper_y листа бумаги
#
# Определить, поместится ли бумага в конверте (стороны листа параллельны сторонам конверта)
# Не забывайте, что лист бумаги можно перевернуть и попробовать вставить в конверт другой стороной.
# Результат проверки вывести на консоль (ДА/НЕТ)
# Использовать только операторы if/elif/else, можно вложенные

envelop_x, envelop_y = 10, 7
paper_x, paper_y = 8, 9
# проверить для
# paper_x, paper_y = 9, 8
# paper_x, paper_y = 6, 8
# paper_x, paper_y = 8, 6
# paper_x, paper_y = 3, 4
# paper_x, paper_y = 11, 9
# paper_x, paper_y = 9, 11
# (просто раскоментировать нужную строку и проверить свой код)

# TODO здесь ваш код
def SizePaper(paper_x, paper_y):
    if(paper_x <= envelop_x) and (paper_y <= envelop_y):
        print('Да')
    elif(paper_y <= envelop_x) and (paper_x <= envelop_y):
        print('Да')
    else:
        print('Нет')

SizePaper(9, 8)
SizePaper(6, 8)
SizePaper(8, 6)
SizePaper(3, 4)
SizePaper(11, 9)
SizePaper(9, 11)

print('----------------------------------------------')

# Усложненное задание, решать по желанию.
# Заданы размеры hole_x, hole_y прямоугольного отверстия и размеры brick_х, brick_у, brick_z кирпича (все размеры
# могут быть в диапазоне от 1 до 1000)
#
# Определить, пройдет ли кирпич через отверстие (грани кирпича параллельны сторонам отверстия)

hole_x, hole_y = 8, 9
# brick_x, brick_y, brick_z = 11, 10, 2
# brick_x, brick_y, brick_z = 11, 2, 10
# brick_x, brick_y, brick_z = 10, 11, 2
# brick_x, brick_y, brick_z = 10, 2, 11
# brick_x, brick_y, brick_z = 2, 10, 11
# brick_x, brick_y, brick_z = 2, 11, 10
# brick_x, brick_y, brick_z = 3, 5, 6
# brick_x, brick_y, brick_z = 3, 6, 5
# brick_x, brick_y, brick_z = 6, 3, 5
# brick_x, brick_y, brick_z = 6, 5, 3
# brick_x, brick_y, brick_z = 5, 6, 3
# brick_x, brick_y, brick_z = 5, 3, 6
# brick_x, brick_y, brick_z = 11, 3, 6
# brick_x, brick_y, brick_z = 11, 6, 3
# brick_x, brick_y, brick_z = 6, 11, 3
# brick_x, brick_y, brick_z = 6, 3, 11
# brick_x, brick_y, brick_z = 3, 6, 11
# brick_x, brick_y, brick_z = 3, 11, 6
# (просто раскоментировать нужную строку и проверить свой код)

# TODO здесь ваш код
def SizeBrick(brick_x, brick_y, brick_z):
    if(brick_x <= hole_x) and (brick_z <= hole_y):
        print('Да')
    elif(brick_z <= hole_x) and (brick_x <= hole_y):
        print('Да')
    else:
        print('Нет')

SizeBrick(11, 10, 2)
SizeBrick(11, 2, 10)
SizeBrick(10, 11, 2)
SizeBrick(10, 2, 11)
SizeBrick(2, 10, 11)
SizeBrick(2, 11, 10)
SizeBrick(3, 5, 6)
SizeBrick(3, 6, 5)
SizeBrick(6, 3, 5)
SizeBrick(6, 5, 3)
SizeBrick(5, 6, 3)
SizeBrick(5, 3, 6)
SizeBrick(11, 3, 6)
SizeBrick(11, 6, 3)
SizeBrick(6, 11, 3)
SizeBrick(6, 3, 11)
SizeBrick(3, 6, 11)
SizeBrick(3, 11, 6)